thegaragelab/babyduino/babyduino/boards.txt
##############################################################

# Babyduino (ATMega8, Internal Clock, 8MHz)
babyduino8_nc.name=Babyduino (ATMega8 Internal Clock)

babyduino8_nc.upload.protocol=arduino
babyduino8_nc.upload.maximum_size=7168
babyduino8_nc.upload.speed=38400

babyduino8_nc.bootloader.low_fuses=0xa4
babyduino8_nc.bootloader.high_fuses=0xc2
babyduino8_nc.bootloader.path=babyboot
babyduino8_nc.bootloader.file=babyduino8_nc.hex
babyduino8_nc.bootloader.unlock_bits=0x3F
babyduino8_nc.bootloader.lock_bits=0x0F

babyduino8_nc.build.mcu=atmega8
babyduino8_nc.build.f_cpu=8000000L
babyduino8_nc.build.core=arduino:arduino
babyduino8_nc.build.variant=arduino:standard

# Babyduino (ATMega88, Internal Clock, 8MHz)
babyduino88_nc.name=Babyduino (ATMega88 Internal Clock)

babyduino88_nc.upload.protocol=arduino
babyduino88_nc.upload.maximum_size=7168
babyduino88_nc.upload.speed=38400

babyduino88_nc.bootloader.low_fuses=0xe2
babyduino88_nc.bootloader.high_fuses=0xd5
babyduino88_nc.bootloader.extended_fuses=0x02
babyduino88_nc.bootloader.path=babyboot
babyduino88_nc.bootloader.file=babyduino88_nc.hex
babyduino88_nc.bootloader.unlock_bits=0x3F
babyduino88_nc.bootloader.lock_bits=0x0F

babyduino88_nc.build.mcu=atmega88
babyduino88_nc.build.f_cpu=8000000L
babyduino88_nc.build.core=arduino:arduino
babyduino88_nc.build.variant=arduino:standard

# Babyduino (ATMega168, Internal Clock, 8MHz)
babyduino168_nc.name=Babyduino (ATMega168 Internal Clock)

babyduino168_nc.upload.protocol=arduino
babyduino168_nc.upload.maximum_size=15360
babyduino168_nc.upload.speed=38400

babyduino168_nc.bootloader.low_fuses=0xe2
babyduino168_nc.bootloader.high_fuses=0xd5
babyduino168_nc.bootloader.extended_fuses=0x02
babyduino168_nc.bootloader.path=babyboot
babyduino168_nc.bootloader.file=babyduino168_nc.hex
babyduino168_nc.bootloader.unlock_bits=0x3F
babyduino168_nc.bootloader.lock_bits=0x0F

babyduino168_nc.build.mcu=atmega168
babyduino168_nc.build.f_cpu=8000000L
babyduino168_nc.build.core=arduino:arduino
babyduino168_nc.build.variant=arduino:standard

